#Область СлужебныеПроцедурыИФункции

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();	
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	Команды = ПараметрыРегистрации.Команды.Добавить();
	Команды.Представление = "Копирование прав, групп и настроек пользователей";
	Команды.Идентификатор = ЭтотОбъект.Метаданные().Имя;
	Команды.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	Возврат ПараметрыРегистрации;
	
КонецФункции // ()

#КонецОбласти
